/* Name for built-in type symbols. */
"Built-in type" = "Built-in type";

/* Name for C language. */
"C" = "C";

/* Name for C++ language. */
"C++" = "C++";

/* Name for category symbols. */
"Category" = "Category";

/* Name for class extension symbols. */
"Class Extension" = "Class Extension";

/* Name for category tag symbols. */
"Category Tag" = "Category Tag";

/* Name for class symbols. */
"Class" = "Class";

/* Name for class method symbols. */
"Class Forward Declaration" = "Class Forward Declaration";

/* Name for class method symbols. */
"Class Method" = "Class Method";

/* Name for class variable symbols. */
"Class Variable" = "Class Variable";

/* Name for constant symbols. */
"Constant" = "Constant";

/* Name for symbol declaration. */
"Declaration" = "Declaration";

/* Name for symbol definition. */
"Definition" = "Definition";

/* Name for enum symbols. */
"Enum" = "Enum";

/* Name for type extension symbols. */
"Extension" = "Extension";

/* Name for field symbols. */
"Field" = "Field";

/* Name for file symbols. */
"File" = "File";

/* Name for function symbols. */
"Function" = "Function";

/* Name for symbol inheritance. */
"Inheritance" = "Inheritance";

/* Name for instance method symbols. */
"Instance Method" = "Instance Method";

/* Name for instance variable symbols. */
"Instance Variable" = "Instance Variable";

/* Name for Java interface symbols. */
"Interface" = "Interface";

/* Name for Java language. */
"Java" = "Java";

/* Local variable in a function or method (used in refactoring, not index) */
"Local Variable" = "Local Variable";

/* Name for macro symbols. */
"Macro" = "Macro";

/* Name for modeled class symbols. */
"Modeled Class" = "Modeled Class";

/* Name for modeled method symbols. */
"Modeled Method" = "Modeled Method";

/* Name for modeled property symbols. */
"Modeled Property" = "Modeled Property";

/* Name for C++ namespace symbols. */
"Namespace" = "Namespace";

/* Name for Objective-C language. */
"Objective-C" = "Objective-C";

/* Name for Objective-C++ language. */
"Objective-C++" = "Objective-C++";

/* Name for Java package symbols. */
"Package" = "Package";

/* Name for parameter symbols. */
"Parameter" = "Parameter";

/* Name for parameter list markers. */
"Parameter List" = "Parameter List";

/* Name for protocol symbols. */
"Protocol" = "Protocol";

/* Name for symbol reference. */
"Reference" = "Reference";

/* Name for struct symbols. */
"Structure" = "Structure";

/* Name for template symbols. */
"Template" = "Template";

/* Name for typedef symbols. */
"Type" = "Type";

/* Name for type descriptor symbols. */
"Type descriptor" = "Type descriptor";

/* Name for union symbols. */
"Union" = "Union";

/* Name for unknown language. */
"Unknown Language" = "Unknown Language";

/* Name for unknown symbol types. */
"Unknown Type" = "Unknown Type";

/* Name for variable symbols. */
"Variable" = "Variable";
